{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "name": "dense_1", "trainable": true, "bias_constraint": null, "use_bias": true, "activation": "relu", "dtype": "float32", "kernel_constraint": null, "units": 800, "bias_regularizer": null, "batch_input_shape": [null, 784], "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "name": "dense_2", "trainable": true, "bias_constraint": null, "use_bias": true, "activation": "softmax", "kernel_constraint": null, "units": 10, "bias_regularizer": null, "activity_regularizer": null}}], "keras_version": "2.0.9", "backend": "tensorflow"}