{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 32, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 32, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.25, "seed": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 64, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 64, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.25, "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "bias_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_3", "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "bias_constraint": null, "activation": "softmax"}}], "keras_version": "2.0.9", "backend": "tensorflow"}