{"class_name": "Sequential", "keras_version": "2.0.9", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 28, 28, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "padding": "valid", "dtype": "float32", "use_bias": true, "trainable": true, "kernel_size": [5, 5], "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_1", "filters": 75, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.2, "trainable": true, "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "valid", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_size": [5, 5], "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_2", "filters": 100, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "rate": 0.2, "trainable": true, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 500, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_3", "rate": 0.5, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 10, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2"}}]}