{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"name": "dense_1", "units": 800, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "use_bias": true, "activation": "relu", "bias_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 784], "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "units": 10, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "use_bias": true, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true}}], "keras_version": "2.0.9"}