{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.9", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "padding": "valid", "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [5, 5], "batch_input_shape": [null, 28, 28, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv2d_1", "bias_constraint": null, "bias_regularizer": null, "filters": 75, "use_bias": true, "dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "padding": "valid", "use_bias": true, "data_format": "channels_last", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv2d_2", "bias_constraint": null, "bias_regularizer": null, "filters": 100, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 500, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_3", "seed": null, "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"units": 10, "activation": "softmax", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null}}]}